// Root menu titles
"actions.text.convert.title" = "Convert / Strip";
"actions.text.lines.title" = "Lines";
"actions.text.selection.title" = "Select";
"actions.text.formatting.title" = "Text";
"actions.text.html.title" = "HTML";

// TEA sub-menu titles
"tea.entities.title" = "Entities";
"tea.tagmanipulation.title" = "Tag Manipulation";

// Convert/Strip menu items
"com.macrabbit.tea-for-two.text-actions.entab.title" = "Spaces To Tabs…";
"com.macrabbit.tea-for-two.text-actions.detab.title" = "Tabs To Spaces…";
"com.macrabbit.tea-for-two.text-actions.straight-quotes.title" = "Straighten Quotes";
"com.macrabbit.tea-for-two.text-actions.curly-quotes.title" = "Curl Quotes";
"com.macrabbit.tea-for-two.text-actions.entity-quotes.title" = "Curl Quotes As HTML Entities";
"com.macrabbit.tea-for-two.text-actions.trim-lines.title" = "Trim Lines";
"com.macrabbit.tea-for-two.text-actions.zap-gremlins.title" = "Zap Gremlins…";

// Lines menu items
"com.macrabbit.tea-for-two.text-actions.move-line-up.title" = "Move Line Up";
"com.macrabbit.tea-for-two.text-actions.move-line-up.title.multiple" = "Move Lines Up";
"com.macrabbit.tea-for-two.text-actions.move-line-down.title" = "Move Line Down";
"com.macrabbit.tea-for-two.text-actions.move-line-down.title.multiple" = "Move Lines Down";
"com.macrabbit.tea-for-two.text-actions.sort-lines-asc.title" = "Sort Lines (Ascending)";
"com.macrabbit.tea-for-two.text-actions.sort-lines-desc.title" = "Sort Lines (Descending)";
"com.macrabbit.tea-for-two.text-actions.randomize-lines.title" = "Randomize Lines";
"com.macrabbit.tea-for-two.text-actions.remove-duplicate-lines.title" = "Remove Duplicate Lines";

// Select menu items
"com.macrabbit.tea-for-two.text-actions.balance.title" = "Balance";
"com.macrabbit.tea-for-two.text-actions.balance-in.title" = "Balance Inward";
"com.macrabbit.tea-for-two.text-actions.select-word.title" = "Word";
"com.macrabbit.tea-for-two.text-actions.select-line.title" = "Line";
"com.macrabbit.tea-for-two.text-actions.select-line-contents.title" = "Line Contents";

// Text menu items
"com.macrabbit.tea-for-two.text-actions.insert-indented-line.title" = "Indent New Line";
"com.macrabbit.tea-for-two.text-actions.insert-text.linebreak.title" = "Insert Linebreak(s)";
"com.macrabbit.tea-for-two.text-actions.insert-text.tab.title" = "Insert Tab In Tab Stop";
"com.macrabbit.tea-for-two.text-actions.wrap.title" = "Wrap With…";

// HTML menu
// Entities items
"com.macrabbit.tea-for-two.text-actions.convert-to-named-entities.title" = "Convert to Named Entities";
"com.macrabbit.tea-for-two.text-actions.convert-to-numeric-entities.title" = "Convert to Numeric Entities";
"com.macrabbit.tea-for-two.text-actions.insert-entity.nbsp.title" = "Insert Non-Breaking Space";
"com.macrabbit.tea-for-two.text-actions.insert-entity.amp.title" = "Insert &";
"com.macrabbit.tea-for-two.text-actions.insert-entity.lt.title" = "Insert <";
"com.macrabbit.tea-for-two.text-actions.insert-entity.gt.title" = "Insert >";
// Formatting items
"com.macrabbit.tea-for-two.text-actions.wrap-em.title" = "Emphasize";
"com.macrabbit.tea-for-two.text-actions.wrap-strong.title" = "Strong";
// Zen items
"com.macrabbit.tea-for-two.text-actions.expand-abbreviation.title" = "Expand Abbreviation";
"com.macrabbit.tea-for-two.text-actions.wrap-with-abbreviation.title" = "Wrap With Abbreviation";
"com.macrabbit.tea-for-two.text-actions.remove-tag.title" = "Remove Tag";
"com.macrabbit.tea-for-two.text-actions.next-edit-point.title" = "Next Edit Point";
"com.macrabbit.tea-for-two.text-actions.previous-edit-point.title" = "Previous Edit Point";
// Wrapping items
"com.macrabbit.tea-for-two.text-actions.wrap-in-snippet.tag.title" = "Wrap Selection In Tag";
"com.macrabbit.tea-for-two.text-actions.wrap-in-snippet.tag.title.multiple" = "Wrap Selections In Tag";
"com.macrabbit.tea-for-two.text-actions.wrap-in-snippet.tag.title.none" = "Insert Tag";
"com.macrabbit.tea-for-two.text-actions.wrap-lines-in-snippet.tag.title" = "Wrap Selected Lines In Tag";
"com.macrabbit.tea-for-two.text-actions.wrap-selection-in-link.title" = "Wrap Selection In Link";

// Experimental
"com.macrabbit.tea-for-two.text-actions.open-linked-file.title" = "Open Linked File";